// **********************************************
// 제  목 : 1주차 실습과제 1-1
// 날  짜 : 2026년 3월 6일
// 작성자 : 2001218 임성배
// **********************************************

/*
1. IDE란 무엇인가?
	- IDE는 통합 개발 환경으로, 소프트웨어 개발에 필요한 여러 도구들을 하나의 프로그램으로 묶어 통합한 개발
	도구이다. IDE가 없던 기존의 개발 환경은 필요한 도구에 따라 여러 프로그램들을 설치하여 따로따로 사용해야
	하는 불편함이 있었다. IDE가 개발된 이후에는 하나의 프로그램에서 여러 작업 도구들을 활용한 효율적인 개발이
	가능하게 되었다.

2. IDE의 종류에 대하여 조사하시오.
	- IDE는 용도와 개발사 등에 따라 여러가지가 있다. Microsoft의 Visual Studio와 Visual Studio Code가 대표적이며,
	윈도우, 맥, 리눅스 환경에서도 구동되고 확장프로그램을 통해 모든 언어들을 사용할 수 있다. 외에도 Eclipse, 
	CLino, Dev-C++ 등이 있으며, 각 목적에 따라 선택하여 사용할 수 있다.

3. IDE에 포함된 기능은 무엇인가?
	- 가장 주된 기능으로 코드 편집기가 있다. 코드 자동완성이나 하이라이트를 해주는 등의 코딩 지원을 해준다.
	이외에도 빌드 자동화와 디버깅, 기능의 버전 관리 등이 있다.
*/